# ColumnBaseAttachmentOffsetParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ColumnBaseAttachmentOffsetParam Property
ParameterTypeId Class See Also
---
"Offset From Attachment At Base"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ColumnBaseAttachmentOffsetParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ColumnBaseAttachmentOffsetParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ColumnBaseAttachmentOffsetParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace